stress_tests/full_run_output.txt
==> Building release binary
==> Starting server (WORKERS=4, QUIET=1, TODO_DB_PATH=stress_todos.db, memory tracking: /usr/bin/time -l)
==> Waiting for server to come up
==> Seeding 20 todos
==> Idle memory after startup + seeding: 11.9 MB total across 5 processes

=== GET / (Todo UI)         threads=8 conns=100 ===
Running 15s test @ http://127.0.0.1:8080/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.64ms  247.89us   7.64ms   95.49%
    Req/Sec     7.36k   669.24    18.87k    94.43%
  880854 requests in 15.10s, 5.39GB read
Requests/sec:  58336.14
Transfer/sec:    365.57MB
Peak server memory: 12.8 MB total across 5 processes (largest single process: 3.3 MB)

=== GET /api/todos (read)   threads=8 conns=100 ===
Running 15s test @ http://127.0.0.1:8080/api/todos
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.50ms  351.26us   9.18ms   92.60%
    Req/Sec     3.44k   622.99    24.78k    99.92%
  411527 requests in 15.10s, 1.00GB read
Requests/sec:  27249.96
Transfer/sec:     67.57MB
Peak server memory: 13.0 MB total across 5 processes (largest single process: 3.5 MB)

=== GET / (Todo UI)         threads=8 conns=1000 ===
Running 15s test @ http://127.0.0.1:8080/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.15ms    2.15ms  53.08ms   96.12%
    Req/Sec     7.28k   412.35     9.21k    93.00%
  869733 requests in 15.01s, 5.32GB read
Requests/sec:  57952.66
Transfer/sec:    363.17MB
Peak server memory: 20.2 MB total across 5 processes (largest single process: 10.7 MB)

=== GET /api/todos (read)   threads=8 conns=1000 ===
Running 15s test @ http://127.0.0.1:8080/api/todos
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.85ms    2.56ms  70.72ms   92.23%
    Req/Sec     3.39k   169.45     4.03k    75.00%
  405390 requests in 15.02s, 0.98GB read
Requests/sec:  26989.12
Transfer/sec:     66.92MB
Peak server memory: 16.8 MB total across 5 processes (largest single process: 10.4 MB)

=== GET / (Todo UI)         threads=8 conns=5000 ===
Running 15s test @ http://127.0.0.1:8080/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    61.40ms   13.55ms 153.07ms   62.44%
    Req/Sec     6.87k   391.89     8.42k    79.75%
  820173 requests in 15.05s, 5.02GB read
  Socket errors: connect 0, read 1997, write 0, timeout 0
Requests/sec:  54503.14
Transfer/sec:    341.55MB
Peak server memory: 43.1 MB total across 5 processes (largest single process: 36.7 MB)

=== GET /api/todos (read)   threads=8 conns=5000 ===
Running 15s test @ http://127.0.0.1:8080/api/todos
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   171.77ms   33.94ms 378.32ms   86.65%
    Req/Sec     3.22k   235.56     3.73k    82.83%
  384793 requests in 15.05s, 0.93GB read
Requests/sec:  25575.03
Transfer/sec:     63.41MB
Peak server memory: 48.8 MB total across 5 processes (largest single process: 42.4 MB)

=== POST /api/todos (write) threads=8 conns=100 ===
Running 15s test @ http://127.0.0.1:8080/api/todos
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.02ms    8.67ms 157.99ms   99.09%
    Req/Sec     2.80k   197.90     4.34k    98.66%
  333263 requests in 15.02s, 74.27MB read
Requests/sec:  22182.84
Transfer/sec:      4.94MB
Peak server memory: 51.5 MB total across 5 processes (largest single process: 45.0 MB)

=== POST /api/todos (write) threads=8 conns=1000 ===
Running 15s test @ http://127.0.0.1:8080/api/todos
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.87ms    3.78ms  86.28ms   95.86%
    Req/Sec     2.79k   180.47     3.58k    86.25%
  333123 requests in 15.03s, 74.34MB read
Requests/sec:  22162.16
Transfer/sec:      4.95MB
Peak server memory: 51.5 MB total across 5 processes (largest single process: 45.0 MB)

=== POST /api/todos (write) threads=8 conns=5000 ===
Running 15s test @ http://127.0.0.1:8080/api/todos
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   131.01ms   31.28ms 351.44ms   78.00%
    Req/Sec     2.72k   236.16     3.22k    79.67%
  325224 requests in 15.05s, 72.58MB read
  Socket errors: connect 0, read 2386, write 0, timeout 0
Requests/sec:  21614.68
Transfer/sec:      4.82MB
Peak server memory: 44.2 MB total across 5 processes (largest single process: 37.8 MB)

==> Done. Stopping server
CExpress cluster master (PID 46828) starting 4 workers on port 8080

Received signal 15, draining connections...
CExpress cluster master (PID 46828) starting 4 workers on port 8080

Received signal 15, draining connections...
CExpress cluster master (PID 46828) starting 4 workers on port 8080

Received signal 15, draining connections...
CExpress cluster master (PID 46828) starting 4 workers on port 8080
Listening on port 8080

Received signal 15, draining connections...
CExpress cluster master (PID 46828) starting 4 workers on port 8080

Master received signal 15, draining 4 workers...
All workers terminated cleanly. Master exiting.

================ Memory summary ================
Idle (after startup + seeding):  11.9 MB total across 5 processes
After all benchmarks (pre-stop): 44.2 MB total across 5 processes

Peak per benchmark (sum of master + workers, sampled every 250ms):
GET / (Todo UI)         threads=8 conns=100              12.8 MB total        3.3 MB largest process
GET /api/todos (read)   threads=8 conns=100              13.0 MB total        3.5 MB largest process
GET / (Todo UI)         threads=8 conns=1000             20.2 MB total       10.7 MB largest process
GET /api/todos (read)   threads=8 conns=1000             16.8 MB total       10.4 MB largest process
GET / (Todo UI)         threads=8 conns=5000             43.1 MB total       36.7 MB largest process
GET /api/todos (read)   threads=8 conns=5000             48.8 MB total       42.4 MB largest process
POST /api/todos (write) threads=8 conns=100              51.5 MB total       45.0 MB largest process
POST /api/todos (write) threads=8 conns=1000             51.5 MB total       45.0 MB largest process
POST /api/todos (write) threads=8 conns=5000             44.2 MB total       37.8 MB largest process

Note: summed RSS counts pages shared between processes (the binary, libc,
SQLite, copy-on-write pages from the fork) once per process, so the total
overstates real physical memory use. The largest-single-process figure is
the more conservative per-worker number.

================ /usr/bin/time -l (whole server run) ================
In cluster mode, 'maximum resident set size' (bytes) is the largest single
process, and user/sys CPU time is summed across the master and every reaped
worker. 'instructions retired', 'cycles elapsed' and 'peak memory footprint'
cover the master process only - do not quote them as whole-server figures.
      135.94 real        59.88 user        60.83 sys
            47218688  maximum resident set size
                   0  average shared memory size
                   0  average unshared data size
                   0  average unshared stack size
                5144  page reclaims
                  15  page faults
                   0  swaps
                   0  block input operations
                   0  block output operations
             7356369  messages sent
             4780248  messages received
                   5  signals received
             1040867  voluntary context switches
               68979  involuntary context switches
            75351595  instructions retired
            67986452  cycles elapsed
             1294624  peak memory footprint

Worker crashes during run: 0